# Задача17: Дан список чисел. Определите сколько в нем встречается различных чисел.
# Пользователь может вводить значения списка или список задан изначально

#spisok = [1,1,2,0,-1,3,4,4]
#list = []
#for i in range(0,len(spisok)):
#    if spisok [i] not in list:
#        list.append(spisok[i])
#print(len(list))

#

#################################

# Задача19: Дана последовательность из N целых чисел и число
# K. Необходимо сдвинуть всю последовательность(сдвиг - циклический)
#  на K элементов вправо, K –положительное число.

# * Input [1, 2, 3, 4, 5] k = 3
# *Output  [4, 5, 1, 2, 3]

#spisok = [1,2,3,4,5,6,7]
#k = int(input('Введите число сдвига: '))
#temp = None
#for i in range(0, k):
#    for j in range(len(spisok)-1, 0, -1):
#        temp = spisok[j]
#        spisok[j] = spisok[j - 1]
#        spisok[j - 1] = temp
#print(spisok)

#######################################

# Задача №21: Напишите программу для печати всех уникальных значений в словаре.

# *Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},
#{"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII":" S007 "}]
# *Output: {'S005', 'S002', 'S007', 'S001', 'S009'}

# Примечание: Список словарей задан изначально. Пользователь не вводит его.


#listOfDictionary = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII":" S007 "}]
#list = []
#for i in listOfDictionary:
#    for j in i.values():
#        if j not in list:
#            list.append(j)
#print(list)

# 2 вариант:

#spisok = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII":" S007 "}]

#result = list()
#for dict in spisok:
#    for k in dict:
#        result.append(dict[k])
#print(set(result))


##################################################

# Задача №23: Дан массив, состоящий из целых чисел.
# Напишите программу, которая подсчитает количество элементов
# массива, больших предыдущего (элемента с предыдущим номером)
# *Input: [0, -1, 5, 2, 3]
# *Output: 2 (-1 < 5, 2 < 3)
# Примечание: Пользователь может вводить значения списка или список задан изначально.

#list =[0, -1, 5, 2, 3]
#count = 0
#for i in range(0, len(list)-1):
#    if list[i+1]>list[i]:
#        count += 1
#print(count)


