# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X
# в массиве A[1..N]. Пользователь в первой строке вводит натуральное
# число N – количество элементов в массиве. В последующих  строках 
# записаны N целых чисел Ai. Последняя строка содержит число X

#*Пример:*
# 5         - N – количество элементов в массиве
# 1 2 3 4 5 - массив
# 3         - число X
# -> 1      - солько раз встречается

"""
n = int(input('Введите количество элементов массива: '))

list = [i for i in range(1, n + 1)]
print(list)

x = int(input('Введите искомое число массива: '))
counter_x = 0
for i in range(0, len(list)-1):
    if list[i] == x:
        counter_x += 1
print('число' ,x , 'встречается в массиве' ,counter_x, 'раз')
"""

    







